content/projects/blog-start.md
+++
title = "Blog"
date = 2020-01-05T19:47:00+01:00
tags = ["blog", "emacs", "hugo", "org"]
categories = ["projects"]
draft = false
[menu.main]
  weight = 2001
  identifier = "blog"
  parent = "Projects"
+++

## What? {#what}

Decided to start a blog.
Nothing fancy, more like a braindump.
All the ideas for projects which are currently in various TODO programs (Google Keep, Todoiost, Wunderlist) and org files, some descriptions for already writen projects with links.
Maybe some ramblings around random thoughts.


## Why? {#why}

Of all the weird places I could get motivation from, the thought occured when reading RFC. A pretty special one, for that: [RFC 8700 - Fifty Years of RFCs](https://tools.ietf.org/html/rfc8700). At one point author remarked a need for less formalized form of discussion; and by that defined RFC as

> The content of a NWG note may be any thought, suggestion, etc.
> related to the HOST software or other aspect of the network.
> Notes are encouraged to be timely rather than polished.
> Philosophical positions without examples or other specifics,
> specific suggestions or implementation techniques without
> introductory or background explication, and explicit questions
> without any attempted answers are all acceptable.  The minimum
> length for a NWG note is one sentence.

Somehow, the idea resonates with me a lot. And so, let's try and see what happens.


## How? {#how}

I like Emacs. So after some research I decided to try [ox-hugo](https://ox-hugo.scripter.co/) for the simplest possible solution.
